/*
MySQL Data Transfer
Source Host: localhost
Source Database: plantdata
Target Host: localhost
Target Database: plantdata
Date: 2013/12/26 19:37:55
*/

SET FOREIGN_KEY_CHECKS=0;
-- ----------------------------
-- Table structure for gallery
-- ----------------------------
DROP TABLE IF EXISTS `gallery`;
CREATE TABLE `gallery` (
  `plantId` text NOT NULL,
  `description` text,
  `photopath` text,
  PRIMARY KEY  (`plantId`(10))
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

-- ----------------------------
-- Records 
-- ----------------------------
INSERT INTO `gallery` VALUES ('SP1131', '原产东亚，在全国和全世界各地均有栽培，通常作为绿篱或观赏用。木槿盛夏季节开花，开花时满树花朵。喜温暖、湿润的气候，但也很耐寒。萌芽性强，耐修剪。对烟尘、二氧化硫、氯气等抗性较强。', 'SP1131.jpg');
INSERT INTO `gallery` VALUES ('SP117', '茉莉喜温暖湿润和阳光充足环境，其叶色翠绿，花朵颜色洁白，香气浓郁，是最常见的芳香性盆栽花木。茉莉有着良好的保健和美容功效，可以用来饮食，可用于茉莉花茶的制作。', 'SP117.jpg');
INSERT INTO `gallery` VALUES ('SP11835', '苏铁科植物是世界上最古老的种子植物，曾与恐龙同时称霸地球，被地质学家誉为“植物活化石”。苏铁树形古雅，主干粗壮，坚硬如铁；羽叶洁滑光亮，四季常青，为珍贵的观赏树种。茎内含淀粉，可供食用。', 'SP11835.jpg');
INSERT INTO `gallery` VALUES ('SP12819', '又叫牵牛花，花酷似喇叭状，因此又叫做喇叭花。花的颜色有蓝、绯红、桃红、紫等，亦有混色的，花瓣边缘的变化较多，是常见的观赏植物。花期以夏季最盛。种子具有药用价值。', 'SP12819.jpg');
INSERT INTO `gallery` VALUES ('SP12959', '头状花序，种子上有白色冠毛结成的绒球，花开后随风飘到新的地方孕育新生命。可供药用，有清热解毒、消肿散结的功效。', 'SP12959.jpg');
INSERT INTO `gallery` VALUES ('SP1336', '玉兰花大、洁白而芳香，是中国著名的早春花木，因为开花时无叶，固有“木花树”之称。玉兰盛开之际有“莹洁清丽，恍疑冰雪”之赞，玉兰花还象征忠贞不渝的爱情。', 'SP1336.jpg');
INSERT INTO `gallery` VALUES ('SP14461', '孔雀草原产墨西哥。是一种适应性十分强的花卉。在我国很多地方也可见到，尤其南方更常见之，它的开花期为3至5月及8至12月。它的花朵有日出开花、日落紧闭的习性，而且以向旋光性方式生长，因此有“爽朗、活泼”的象征意义。', 'SP14461.jpg');
INSERT INTO `gallery` VALUES ('SP1501', '槲寄生，顾名思义，就是寄生在其他植物上的植物，可以从寄主植物上吸取水分和无机物，进行光合作用制造养分。它四季常青，开黄色花朵，入冬结出各色的浆果。据记载，寄生于榆树的槲寄生果实为橙红色，寄生于杨树和枫杨的果实呈淡黄色，寄生于梨树或山荆子的则呈红色或黄色。', 'SP1501.jpg');
INSERT INTO `gallery` VALUES ('SP15194', '使君子为落叶攀援状灌木，花期5～9月，产四川、贵州至南岭以南各处，长江中下游以北无野生记录。使君子始载于《南方草木状》：“形如栀子，棱瓣深而两头尖，似诃梨勒而轻，及半黄已熟，中有肉白色，甘如枣，核大。”', 'SP15194.jpg');
INSERT INTO `gallery` VALUES ('SP15676', '俗称康乃馨，这是一种态玲珑、斑谰雅洁、端庄大方、芳香清幽的花，是优异的切花品种。康乃馨代表爱、魅力和尊敬之情，与玫瑰所不同的，康乃馨代表的爱表现为比较清淡和温馨，适于形容亲情之爱。', 'SP15676.jpg');
INSERT INTO `gallery` VALUES ('SP16057', '俗称金银花。“金银花”一名出自《本草纲目》，由于忍冬花初开为白色，后转为黄色，因此得名。金银花自古被誉为清热解毒的良药。它性甘寒气芳香，甘寒清热而不伤胃，芳香透达又可祛邪。', 'SP16057.jpg');
INSERT INTO `gallery` VALUES ('SP16478', '昙花原产美洲，因美丽而不失优雅，现全球均有栽培。一般在晚上8－12时开花，约4－5小时即凋谢，故有“昙花一现“之说。昙花生长时花蕾下垂，经开时，花瓣缓缓张开而微微颤动，筒部向上翘起。花洁白如玉，清香四溢。因而被誉为“月下美人”。', 'SP16478.jpg');
INSERT INTO `gallery` VALUES ('SP16738', '又叫止血草、星辰花、勿忘我。多年生草本植物，叶互生，狭倒披针形或条状倒披针形。茎高10~50cm，特别在野生状态中，尤为细小纤弱，花杂蓝色。喜阳，能耐阴，易自播繁殖。勿忘我花小巧秀丽，蓝色花朵中央有一圈黄色心蕊，色彩搭配和谐醒目，尤其是卷伞花序随着花朵的开放逐渐伸长，半含半露，惹人喜爱，令人难忘。', 'SP16738.jpg');
INSERT INTO `gallery` VALUES ('SP16831', '木棉树形高大，雄壮魁梧，枝干舒展，花红如血，硕大如杯，由于是先长花芽再长叶芽，盛开时冬天落尽的叶片几乎全未长出，远观好似一团团在枝头尽情燃烧、欢快跳跃的火苗，极有气势。因此，历来被人们视为英雄的象征。', 'SP16831.jpg');
INSERT INTO `gallery` VALUES ('SP16892', '凌霄花又叫紫葳、五爪龙等。落叶藤木，借气生根攀援它物向上生长。有药用价值，具有行血去瘀、凉血祛风之功能，还具有观赏价值。', 'SP16892.jpg');
INSERT INTO `gallery` VALUES ('SP18954', '马蹄莲又叫慈菇花、水芋马，观音莲。叶片翠绿，花苞片洁白硕大，宛如马蹄，形状奇特，是国内外重要的切花花卉，用途十分广泛。马蹄莲花有毒，内含大量草本钙结晶和生物碱，误食会引起昏眠等中毒症状。', 'SP18954.jpg');
INSERT INTO `gallery` VALUES ('SP19265', '夹竹桃的叶片如柳似竹，红花灼灼，胜似桃花，花冠粉红至深红或白色，有特殊香气，花期为6~10月，是有名的观赏花卉。夹竹桃也有净化空气、保护环境的能力，叶及茎皮有剧毒，入药煎汤或研末，均宜慎用。', 'SP19265.jpg');
INSERT INTO `gallery` VALUES ('SP19540', '又名彼岸花，属于石蒜科。石蒜类的特性是花开时看不到叶子，有叶子时看不到花，花叶两不相见，生生相错，因此才有“彼岸花，开彼岸，只见花，不见叶”的说法。是说,叶掉光了,花才开始生长,虽是同根生,但两者从不相遇,从没见过对方。相念相惜永相失，如此轮回而花叶永不相见，也有着永远无法相会的悲恋之意。', 'SP19540.jpg');
INSERT INTO `gallery` VALUES ('SP19558', '水仙又叫凌波仙子、玉玲珑，在中国已有一千多年栽培历史，是中国的传统名花。水仙花通常是在精致的浅盆中栽培，然而，它对生活也挺简单朴素，适当的阳光和温度，只凭一勺清水，几粒石子也就能生根发芽。全草科入药，主治跌打损伤、痨伤。', 'SP19558.jpg');
INSERT INTO `gallery` VALUES ('SP19583', '原产于非洲南部，是一种高品味的名贵花卉，它的拉丁文名字含有高贵、美好的意思。“百花虽好不用问，唯有君子压群芳”，君子兰之所以特别受人喜爱，它不仅有令人赏心悦目的花朵，更有碧绿光亮、犹如着蜡、晶莹剔透、光彩照人的叶片。', 'SP19583.jpg');
INSERT INTO `gallery` VALUES ('SP20568', '曼陀罗又叫大喇叭花、山茄子，植株高大，花朵硕大而美丽，宜作背景材料或用于野趣园。原产自亚洲的热带及亚热带地区，我国各省现均有分布。全株有剧毒，其叶、花、籽均可入药。', 'SP20568.jpg');
INSERT INTO `gallery` VALUES ('SP2072', '富有很高观赏价值的郁金香，是当今风行全球的一代名花。花容端庄，色色俱备，活像一个高脚的酒杯，鲜艳夺目，异彩纷呈，细赏之下有如春风扑面，令人心旷神怕。许多荷兰人曾因栽种郁金香而致富，并且被公众评选为国花。', 'SP2072.jpg');
INSERT INTO `gallery` VALUES ('SP217', '俗称桂花，是中国传统十大花卉之一，它清可绝尘，浓能远溢，堪称一绝。尤其是中秋时节，丛桂怒放，夜静轮圆之际，把酒赏桂，陈香扑鼻，令人神清气爽。在中国古代的咏花诗词中，咏桂之作的数量也颇为可观。自古就深受中国人的喜爱，被视为传统名花。', 'SP217.jpg');
INSERT INTO `gallery` VALUES ('SP22350', '垂柳枝条细长，柔软下垂，随风飘舞，姿态优美潇洒，植于河岸及湖池边最为理想，柔条依依拂水，别有风致，自古即为重要的庭园观赏树。亦可用作道树、庭荫树、固岸护堤树及平原造林树种。此外，垂柳对有毒气体抗性较强，并能吸收二氧化硫，故也适用于工厂区绿化。', 'SP22350.jpg');
INSERT INTO `gallery` VALUES ('SP22384', '胡杨耐旱耐涝，生命顽强，是自然界稀有的树种之一。胡杨树龄可达200年，树干通直，稀灌木状。胡杨是干旱大陆性气侯条件下的树种。胡杨喜光，能够抵抗高温、干旱、盐碱、风沙等。', 'SP22384.jpg');
INSERT INTO `gallery` VALUES ('SP22796', '六月雪，又名碎叶冬青、素馨、悉茗。常绿小灌木，六月开花，远看如银装素裹，犹如六月飘雪，雅洁可爱，故名。', 'SP22796.jpg');
INSERT INTO `gallery` VALUES ('SP22994', '栀子花枝叶繁茂，叶色四季常绿，花芳香素雅，绿叶白花，格外清丽可爱，为庭院中优良的美化材料，它适用于阶前、池畔和路旁配置，也可用作花篱、盆栽和盆景观赏，花还可做插花和佩带装饰。一朵娇俏动人的小花，不时发出清新的香味，令人留恋往返。', 'SP22994.jpg');
INSERT INTO `gallery` VALUES ('SP23339', '垂丝海棠花色艳丽，其果实亦玲珑可观。至秋季果实成熟，红黄果实高悬枝间，恰似红灯点点，随风摇曳，别具风姿。垂丝海棠性喜阳光，不耐阴，也不甚耐寒，爱温暖湿润环境，适生于阳光充足、背风之处。', 'SP23339.jpg');
INSERT INTO `gallery` VALUES ('SP244', '紫丁香是中国特有的名贵花木，已有1000多年的栽培历史。植株丰满秀丽，枝叶茂密，且具独特的芳香。紫丁香的叶可以入药，味苦、性寒，有清热燥湿的作用。', 'SP244.jpg');
INSERT INTO `gallery` VALUES ('SP25136', '石榴既可观赏又可食用。石榴花开于初夏，绿叶荫荫之中，燃起一片火红，灿若烟霞，绚烂之极。赏过了花，再过两三个月，红红的果实又挂满了枝头，正是“丹葩结秀，华实并丽”。', 'SP25136.jpg');
INSERT INTO `gallery` VALUES ('SP25534', '报春花属植物在世界上栽培很广，历史亦较久远，发展很快，已成为当前一类重要的园林花卉。中名报春和学名Primula，均含有早花的意思。早春开花为本属植物的重要特性。', 'SP25534.jpg');
INSERT INTO `gallery` VALUES ('SP25801', '马齿苋常生在荒地、田间、菜园、路旁。马齿苋可供食用，是我国自古就喜欢采食的一种野菜，美味可口，食之不厌。全草亦可药用，有清热利湿、解毒消肿等作用。', 'SP25801.jpg');
INSERT INTO `gallery` VALUES ('SP26429', '上海法国租界首先引入此树种为行道树，故在中国俗称为“法国梧桐”。法国梧桐适应性强，又耐修剪整形，是优良的行道树种，广泛应用于城市绿化，在园林中孤植于草坪或旷地，列植于街道两旁，作为街坊、广场、校园绿化颇为合适花卉，果可入药。', 'SP26429.jpg');
INSERT INTO `gallery` VALUES ('SP26601', '雪松是世界著名的庭园观赏树种之一。它具有较强的防尘、减噪与杀菌能力，也适宜作工矿企业绿化树种。雪松树体高大，树形优美，最适宜孤植于草坪中央、建筑前庭之中心、广场中心或主要建筑物的两旁及园门的入口等处。其主干下部的大枝自近地面处平展，长年不枯，能形成繁茂雄伟的树冠，此外，列植于园路的两旁，形成甬道，亦极为壮观。', 'SP26601.jpg');
INSERT INTO `gallery` VALUES ('SP27044', '虞美人姿态葱秀，袅袅娉娉,因风飞舞，俨然彩蝶展翅，颇引人遐思。虞美人兼具素雅与浓艳华丽之美，二者和谐地统一于一身。其容其姿大有中国古典艺术中美人的丰韵，堪称花草中的妙品。虞美人又叫丽春花、赛牡丹、田野罂粟，是比利时国花。', 'SP27044.jpg');
INSERT INTO `gallery` VALUES ('SP27109', '别名大王椰子、假槟榔。树形独特美观，两头细，中间粗，基部膨大，像花瓶。它以奇异的纺锤状高大树干和超凡脱俗的气度，被人们誉为棕榈植物中的“白马王子”。它源产于美洲古巴，现已广泛分布于世界各热带地区，我国广东、广西、云南和台湾等地也有栽培。', 'SP27109.jpg');
INSERT INTO `gallery` VALUES ('SP28791', '山葡萄又名野葡萄，在葡萄属中是抗寒能力最强的种类。其藤可长达15米，树皮暗褐色或红褐色，藤匍匐或援于其它树木上。果可生食或酿酒，酒糟可制醋和染料，种子可炸油。', 'SP28791.jpg');
INSERT INTO `gallery` VALUES ('SP28937', '冰岛国花，在欧洲是常见的野花，也常栽培于公园中，是布置春季花坛的主要花卉。三色菫以露天栽种为宜，无论花坛、庭园、盆栽皆适合。', 'SP28937.jpg');
INSERT INTO `gallery` VALUES ('SP3089', '紫藤是一种落叶攀援缠绕性大藤本植物。紫藤开花繁多，串串花序悬挂于绿叶藤蔓之间，瘦长的荚果迎风摇曳，自古以来中国文人皆爱以其为题材咏诗作画。', 'SP3089.jpg');
INSERT INTO `gallery` VALUES ('SP31064', '花色鲜艳，有淡红色、紫红色、白色、复色等。花瓣类型有单瓣类、复瓣露心类、托桂类、曲瓣类、半平瓣类和平瓣类。在巴蜀地区栽培已有2000多年的历史，苏轼曾有“游蜂掠尽粉丝黄，落蕊犹收蜜露香”的诗句咏山茶花。1986年山茶花被定为重庆市市花。', 'SP31064.jpg');
INSERT INTO `gallery` VALUES ('SP31168', '稀有种。在中生代白垩纪，地球上已出现水杉类植物。约发展在250万年前的冰期以后，这类植物几乎全部绝迹，仅存水杉一种。水杉树干通直挺拔，高大秀颀，树冠呈圆锥形，姿态优美，叶色翠绿秀丽，枝叶繁茂，入秋后叶色金黄，是著名的庭院观赏树。', 'SP31168.jpg');
INSERT INTO `gallery` VALUES ('SP313', '白睡莲是著名的水生观赏花卉，原产于黄河下游等地，因其花色艳丽，花姿楚楚动人，在一池碧水中宛如冰肌脱俗的少女，而被人们赞誉为“水中女神”。睡莲根能吸收水中的有毒物质，过滤水中的微生物，是难得的水体净化植物材料。', 'SP313.jpg');
INSERT INTO `gallery` VALUES ('SP316', '俗称荷花、莲花、水芙蓉等。用荷花布置水景，在中国园林中极为普通，江南一带名园，多设有欣赏荷花风景的建筑。荷花“出淤泥而不染，濯清涟而不妖”的高尚品格，历来为文人墨客歌咏绘画的题材。荷花也有重要的药用价值，《本草纲目》记载荷花能活血止血、去湿消风，莲子能养心、益肾。', 'SP316.jpg');
INSERT INTO `gallery` VALUES ('SP3289', '紫荆因“其木似黄荆而色紫”而得名，是春季重要的观赏灌木。花朵漂亮、鲜艳，花形似蝶，盛开时花朵繁多，成团簇状，给人以繁花似锦的感觉。紫荆的树皮、木材、根均可入药。', 'SP3289.jpg');
INSERT INTO `gallery` VALUES ('SP34', '银杏树又名白果树，生长较慢，寿命极长，自然条件下从栽种到结果要二十多年，四十年后才能大量结果，因此别名“公孙树”，有“公种而孙得食”的含义，是树中的老寿星，古称“白果”。银杏树是第四纪冰川运动后遗留下来的最古老的裸子植物，是世界上十分珍贵的树种之一，因此被当作植物界中的“活化石”。银杏树具有欣赏，经济，药用价值，全身是“宝”。', 'SP34.jpg');
INSERT INTO `gallery` VALUES ('SP5116', '鸢尾花，又叫紫蝴蝶、蓝蝴蝶、乌鸢、扁竹花、蝴蝶兰，“鸢尾”之名来源于希腊语，意思是彩虹。古埃及的金字塔群中就有鸢尾形象的记录，其历史可追溯到公元前1500年。', 'SP5116.jpg');
INSERT INTO `gallery` VALUES ('SP8969', '又叫光棍树、绿珊瑚、铁树。喜温暖，耐旱，耐盐，耐风，好光照，能于贫瘠土壤生长，因能常用作海边防风林或美化树种。全草可药用，可治疗关节肿痛。', 'SP8969.jpg');
INSERT INTO `gallery` VALUES ('SP93', '又名灯笼花，是我国习见的盆栽花卉，开花时，垂花朵朵，婀娜多姿，如悬挂的彩色灯笼，观赏性强，常作盆花观赏。倒挂金钟还是一种传统中药材，具有行血去瘀、凉血祛风之功能。', 'SP93.jpg');
INSERT INTO `gallery` VALUES ('SP9635', '杜鹃花，中国十大名花之一。在所有观赏花木之中，称得上花、叶兼美，地栽、盆栽皆宜，用途最为广泛的。中国是世界杜鹃花资源的宝库，江西、安徽、贵州均以杜鹃为省花，将杜鹃定为市花的城市多达八个。', 'SP9635.jpg');
